Tekla.Structures.Drawing.LevelMark
The LevelMark class defines a drawing object that is displayed as a level mark in a drawing.
See the Tekla Structures help for more information.
using Tekla.Structures.Drawing;
using Tekla.Structures.Drawing.UI;
using Tekla.Structures.Geometry3d;
namespace Example
{
class Program
{
public static void LevelMarkModify()
{
DrawingHandler myDrawingHandler = new DrawingHandler();
DrawingObjectSelector dos = myDrawingHandler.GetDrawingObjectSelector();
DrawingObjectEnumerator allObjectsOnSheet = dos.GetSelected();
while(allObjectsOnSheet.MoveNext())
{
if(allObjectsOnSheet.Current is Tekla.Structures.Drawing.LevelMark)
{
LevelMark levelMark = allObjectsOnSheet.Current as Tekla.Structures.Drawing.LevelMark;
levelMark.Attributes.Font.Height = 5;
levelMark.Attributes.Font.Color = DrawingColors.Red;
levelMark.Attributes.Frame.Color = DrawingColors.Yellow;
levelMark.Attributes.Frame.Type = FrameTypes.Round;
bool res = levelMark.Modify();
}
}
}
public static LevelMark GetSelectedLevelMark()
{
DrawingHandler myDrawingHandler = new DrawingHandler();
DrawingObjectSelector dos = myDrawingHandler.GetDrawingObjectSelector();
DrawingObjectEnumerator allObjectsOnSheet = dos.GetSelected();
while(allObjectsOnSheet.MoveNext())
{
if(allObjectsOnSheet.Current is Tekla.Structures.Drawing.LevelMark)
{
LevelMark levelMark = allObjectsOnSheet.Current as Tekla.Structures.Drawing.LevelMark;
return levelMark;
}
}
return null;
}
public static void LevelMarkCreateAsACopy()
{
var levelmark = GetSelectedLevelMark();
levelmark.InsertionPoint.X += 100;
levelmark.Insert();
}
public static void LevelMarkCreate()
{
DrawingHandler MyDrawingHandler = new DrawingHandler();
var drawing1 = MyDrawingHandler.GetActiveDrawing();
var sheet1 = drawing1.GetSheet();
var allviews = sheet1.GetAllViews();
foreach(var item in allviews)
{
ViewBase view = item as ViewBase;
LeaderLinePlacing leaderLinePlacing = new LeaderLinePlacing(new Point(0000, 1000, 0));
LevelMark levelMark = new LevelMark(view, new Point(1000, 2000, 0), leaderLinePlacing);
levelMark.Attributes.Font.Height = 4.0;
bool res = levelMark.Insert();
}
}
static void Main(string[] args)
{
LevelMarkCreate();
//LevelMarkCreateAsACopy();
//LevelMarkModify();
DrawingHandler myDrawingHandler = new DrawingHandler();
myDrawingHandler.GetActiveDrawing().CommitChanges();
}
}
}

Tekla.Structures.Drawing.LevelMark.#ctor(Tekla.Structures.Drawing.ViewBase,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point)
Initializes a new instance of the Tekla.Structures.Drawing.LevelMark class using the default standard attributes.
View: The view where to insert the level mark.
InsertionPoint: The location where to place the level mark.
BasePoint: The location where to the level mark points.

Tekla.Structures.Drawing.LevelMark.#ctor(Tekla.Structures.Drawing.ViewBase,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Drawing.PlacingBase)
Initializes a new instance of the Tekla.Structures.Drawing.LevelMark class using the given attributes.
View: The view where to insert the level mark.
InsertionPoint: The location where to place the level mark.
BasePoint: The location where to the level mark points.
Placing: The way the object is placed.

Tekla.Structures.Drawing.LevelMark.#ctor(Tekla.Structures.Drawing.ViewBase,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Drawing.LevelMark.LevelMarkAttributes)
Initializes a new instance of the Tekla.Structures.Drawing.LevelMark class using the given attributes.
View: The view where to insert the level mark.
InsertionPoint: The location where to place the level mark.
BasePoint: The location where to the level mark points.
Attributes: The level mark attributes to be applied.

Tekla.Structures.Drawing.LevelMark.#ctor(Tekla.Structures.Drawing.ViewBase,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Drawing.ModelObject)
Initializes a new instance of the Tekla.Structures.Drawing.LevelMark class using the given attributes.
View: The view where to insert the level mark.
InsertionPoint: The location where to place the level mark.
BasePoint: The location where to the level mark points.
modelObject: The model object that the Mark will be attached to.

Tekla.Structures.Drawing.LevelMark.#ctor(Tekla.Structures.Drawing.ViewBase,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Drawing.PlacingBase,Tekla.Structures.Drawing.LevelMark.LevelMarkAttributes)
Initializes a new instance of the Tekla.Structures.Drawing.LevelMark class using the given attributes.
View: The view where to insert the level mark.
InsertionPoint: The location where to place the level mark.
BasePoint: The location where to the level mark points.
Placing: The way the object is placed.
Attributes: The level mark attributes to be applied.

Tekla.Structures.Drawing.LevelMark.#ctor(Tekla.Structures.Drawing.ViewBase,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Drawing.PlacingBase,Tekla.Structures.Drawing.ModelObject)
Initializes a new instance of the Tekla.Structures.Drawing.LevelMark class using the given attributes.
View: The view where to insert the level mark.
InsertionPoint: The location where to place the level mark.
BasePoint: The location where to the level mark points.
Placing: The way the object is placed.
modelObject: The model object that the Mark will be attached to.

Tekla.Structures.Drawing.LevelMark.#ctor(Tekla.Structures.Drawing.ViewBase,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Drawing.ModelObject,Tekla.Structures.Drawing.LevelMark.LevelMarkAttributes)
Initializes a new instance of the Tekla.Structures.Drawing.LevelMark class using the given attributes.
View: The view where to insert the level mark.
InsertionPoint: The location where to place the level mark.
BasePoint: The location where to the level mark points.
modelObject: The model object that the Mark will be attached to.
Attributes: The level mark attributes to be applied.

Tekla.Structures.Drawing.LevelMark.#ctor(Tekla.Structures.Drawing.ViewBase,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Drawing.PlacingBase,Tekla.Structures.Drawing.ModelObject,Tekla.Structures.Drawing.LevelMark.LevelMarkAttributes)
Initializes a new instance of the Tekla.Structures.Drawing.LevelMark class using the given attributes.
View: The view where to insert the level mark.
InsertionPoint: The location where to place the level mark.
BasePoint: The location where to the level mark points.
modelObject: The model object that the Mark will be attached to.
Attributes: The level mark attributes to be applied.
Placing: The way the object is placed.

Tekla.Structures.Drawing.LevelMark.#ctor
Initializes a new instance of the Tekla.Structures.Drawing.LevelMark class.

Tekla.Structures.Drawing.LevelMark.SubType
Gets or sets the subtype of the level mark.

Tekla.Structures.Drawing.LevelMark.Attributes
Gets or sets the level mark attributes.

Tekla.Structures.Drawing.LevelMark.InsertionPoint
Gets or sets the level mark insertion point.

Tekla.Structures.Drawing.LevelMark.BasePoint
Gets or sets the level mark base point.

Tekla.Structures.Drawing.LevelMark.Placing
Gets or sets the current placing of the object.
See the placing types for different placing options.

Tekla.Structures.Drawing.LevelMark.Hideable
Gets the information if this object is hidden or not or if it should be.

Tekla.Structures.Drawing.LevelMark.ModelObjectIdentifier
Gets the model object identifier

Tekla.Structures.Drawing.LevelMark.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.

Tekla.Structures.Drawing.LevelMark.GetObjectAlignedBoundingBox
Returns the bounding box of the level mark (rectangle format).
Returns: The bounding box of the level mark.

Tekla.Structures.Drawing.LevelMark.GetAxisAlignedBoundingBox
Returns the axis aligned bounding box of the level mark (rectangle format).
Returns: The bounding box of the level mark.

Tekla.Structures.Drawing.LevelMark.MoveObjectRelative(Tekla.Structures.Geometry3d.Vector)
Moves the object using the move vector.
MoveVector: The move vector to be used.
Returns: True.

Tekla.Structures.Drawing.LevelMark.GetObjects
Gets the children objects of the current object.
Returns: The children objects of the current object.

Tekla.Structures.Drawing.LevelMark.GetObjects(System.Type[])
Gets the children objects of the current object that are of certain types.
TypeFilter: The types of the objects to get.
Returns: The children objects of the current object that are of certain types.

Tekla.Structures.Drawing.LevelMark.Insert
Inserts the level mark into the current drawing database.
Returns: True on success.

Tekla.Structures.Drawing.LevelMark.Select
Selects the level mark from the current drawing database.
Returns: True on success.

Tekla.Structures.Drawing.LevelMark.Modify
Modifies the level mark in the current drawing database.
Throws Tekla.Structures.Drawing.InvalidAttributesForOperationException: Thrown if Attributes contains values that are not supported by the object.
Returns: True on success.

Tekla.Structures.Drawing.LevelMark.Delete
Deletes the level mark from the current drawing database.
Returns: True on success.

Tekla.Structures.Drawing.LevelMark.DbOperation(Tekla.Structures.DrawingInternal.QueryTypeEnum)
Call TS and perform database operation specified in OperationType.
OperationType: The type of the operation.
Returns: True on success.

Tekla.Structures.Drawing.LevelMark.Initialize(System.Boolean)
Initializes this instance.